
## Plan Result




<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.et-api-postgres-url
  * azurerm_key_vault_secret.et1-postgres-url
  * azurerm_key_vault_secret.et3-postgres-url
* Update
  * module.etapi-redis.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.et-api-postgres-url will be created
  + resource "azurerm_key_vault_secret" "et-api-postgres-url" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat"
      + name                    = "et-api-postgres-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et1-postgres-url will be created
  + resource "azurerm_key_vault_secret" "et1-postgres-url" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat"
      + name                    = "et1-postgres-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et3-postgres-url will be created
  + resource "azurerm_key_vault_secret" "et3-postgres-url" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat"
      + name                    = "et3-postgres-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.etapi-redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-cache-aat/providers/Microsoft.Cache/redis/et-pet-api-aat"
        name                          = "et-pet-api-aat"
        tags                          = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          + data_persistence_authentication_method  = "SAS"
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (8 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"","Vars":{}} -->